{
    "version": "https://jsonfeed.org/version/1",
    "title": "LinhNT's Blog",
    "home_page_url": "https://nguyentienlinh2611.github.io/",
    "feed_url": "https://nguyentienlinh2611.github.io/feed.json",
    "items": [
        {
            "id": "https://nguyentienlinh2611.github.io/2019/05/06/writing-a-vuepress-theme/",
            "url": "https://nguyentienlinh2611.github.io/2019/05/06/writing-a-vuepress-theme/",
            "title": "Writing a vuepress theme 1",
            "summary": "To write a theme, create a .vuepress/theme directory in your docs root, and then create a Layout.vue file:\n.\n└─ .vuepress\n   └─ theme\n       └─ Layout.vue\n\nFrom there it's the same as developing a normal Vue application. It is entirely up to you how to organize your theme.",
            "date_modified": "2019-05-06T00:00:00.000Z"
        },
        {
            "id": "https://nguyentienlinh2611.github.io/2021/06/20/hello-word/",
            "url": "https://nguyentienlinh2611.github.io/2021/06/20/hello-word/",
            "title": "Hello, World",
            "summary": "When Louise opened her eyes she stared dreamily up at the slight abrasion in the shingle roof through which morning blinked. There were not many of these informal skylights, for the roof was not an old one. But there were a few, as there are likely to be in most summer cottages. When there was a violent downpour one had to hustle around distributing pans and kettles to catch an often ambitious drip. But this morning there was no rain. Louise's pretty face was not in danger of an unsolicited bath. It was a radiant summer dawn.",
            "date_modified": "2021-06-20T00:00:00.000Z"
        },
        {
            "id": "https://nguyentienlinh2611.github.io/2021/06/21/hello-word/",
            "url": "https://nguyentienlinh2611.github.io/2021/06/21/hello-word/",
            "title": "Hello, World",
            "summary": "For a moment she wondered how she had happened to wake so early. The July birds were all chattering in the woods. But why should she waken out of deep slumber unsummoned? Presently, however, the reason for this phenomenon flashed vividly. Downstairs in the cottage living room, on the chimney-piece, stood an old Dutch clock. This clock possessed a kind of wiry, indignant tick, and a voice, when it was time to speak, full of a jerky, twanging spite.",
            "date_modified": "2021-06-21T00:00:00.000Z"
        },
        {
            "id": "https://nguyentienlinh2611.github.io/2021/06/22/hello-word/",
            "url": "https://nguyentienlinh2611.github.io/2021/06/22/hello-word/",
            "title": "Hello, World",
            "summary": "Louise could hear the sharp ticking. Then there came a little whirr—like a very wheeze of decrepitude—followed by an angry striking. One, two, three, four. And at the very first stroke[Pg 12] she knew why she was awake at so almost grotesque an hour. The remembrance brought its half whimsical shock. In an hour Leslie would be cranking the engine of his little launch, and they would be chugging toward Beulah.",
            "date_modified": "2021-06-22T00:00:00.000Z"
        },
        {
            "id": "https://nguyentienlinh2611.github.io/2021/06/23/hello-linh/",
            "url": "https://nguyentienlinh2611.github.io/2021/06/23/hello-linh/",
            "title": "Hello, Linh",
            "date_modified": "2021-06-23T00:00:00.000Z"
        }
    ]
}